tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "shopify/shopify"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk"
# Persistent key-value database, with built-in net interface
brew "redis"
# Cross-shell prompt for astronauts
brew "starship"
# Lightweight BitTorrent client
brew "transmission-cli"
# UNIX shell (command interpreter)
brew "zsh"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
brew "shopify/shopify/shopify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Calendar for professionals and teams
cask "cron"
# Voice and text chat software
cask "discord"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inter"
# Desktop client for GitHub repositories
cask "github"
# Character search for designers, developers and writers
cask "glyphfinder"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-dev"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Screen and video recording software
cask "loom"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Control your tools with a few keystrokes
cask "raycast"
# Modified browser that helps in responsive web development
cask "responsively"
# Team communication and collaboration software
cask "slack"
# Open-source BitTorrent client
cask "transmission"
# Font manager application
cask "typeface"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "Alfread", id: 1521082061
mas "Boop", id: 1518425043
mas "CleanMyMac-MAS", id: 1339170533
mas "Contrast", id: 1254981365
mas "Eagle for Safari", id: 1526651672
mas "GIF Brewery 3", id: 1081413713
mas "Gifski", id: 1351639930
mas "Hand Mirror", id: 1502839586
mas "JSONPeep", id: 1458969831
mas "Keystroke Pro", id: 1572206224
mas "NotePlan 3", id: 1505432629
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Transmit", id: 1436522307
mas "Tweetbot", id: 1384080005
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835
