tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Modern replacement for 'ls'
brew "exa"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Installer for BetterDiscord
cask "betterdiscord-installer"
# Calendar for professionals and teams
cask "cron"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Collaborative team software
cask "figma-beta"
cask "font-fira-code"
cask "font-inter"
# Desktop client for GitHub repositories
cask "github"
cask "glyphfinder"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-dev"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# File archiver
cask "keka"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdBlock", id: 1402042596
mas "Boop", id: 1518425043
mas "CleanMyMac-MAS", id: 1339170533
mas "Contrast", id: 1254981365
mas "GIF Brewery 3", id: 1081413713
mas "Gifski", id: 1351639930
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Save to Raindrop.io", id: 1549370672
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835
