tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Cross-shell prompt for astronauts
brew "starship"
# Lightweight BitTorrent client
brew "transmission-cli"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Calendar for professionals and teams
cask "cron"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inter"
# Desktop client for GitHub repositories
cask "github"
# Character search for designers, developers and writers
cask "glyphfinder"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-dev"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Calculator and converter application
cask "numi"
# Control your tools with a few keystrokes
cask "raycast"
# Font manager application
cask "typeface"
# Open-source code editor
cask "visual-studio-code"
mas "Contrast", id: 1254981365
mas "Hand Mirror", id: 1502839586
mas "Keystroke Pro", id: 1572206224
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835
